Revit 2027 API
ViewSystemsAnalysisReport.AnalysisDateAndTime Property
 Identifies the analysis date and time when it was requested.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DateTime AnalysisDateAndTime { get; }
Public ReadOnly Property AnalysisDateAndTime As DateTime
	Get
public:
property DateTime AnalysisDateAndTime {
	DateTime get ();
}
member AnalysisDateAndTime : DateTime with get
Property Value
DateTime
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace